---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.SectionArea
source: html/4e7f946a-b811-a79f-6f29-30a12ef87baf.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.SectionArea Property

Cross section area.

## Syntax (C#)
```csharp
public double SectionArea { get; set; }
```